src/Catalogs/ОператорыМаркировки/ОператорыМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОператорыМаркировки</name>
  <attributes>
    <name>Страна</name>
    <type>
      <types>EnumRef.Страны</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкружениеОператораМаркировки</name>
    <type>
      <types>EnumRef.ОкружениеОператораМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючAPI</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ОператорыМаркировки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Активный Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОператорыМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОператорыМаркировки КАК ОператорыМаркировки
	|ГДЕ
	|	ОператорыМаркировки.Страна = &Страна
	|	И ОператорыМаркировки.Активный = ИСТИНА
	|	И ОператорыМаркировки.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Страна", Страна);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектСсылка = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектСсылка.Активный = Ложь;
		ОбъектСсылка.Записать(РежимЗаписи.Запись);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
